# DebugtabDataboundcontrolsdemoInteger Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DebugtabDataboundcontrolsdemoInteger Property
ParameterTypeId Class See Also
---
"Integer"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DebugtabDataboundcontrolsdemoInteger { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DebugtabDataboundcontrolsdemoInteger As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DebugtabDataboundcontrolsdemoInteger {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace